In [ ]:
#STUDI KASUS:
#Buatlah 5 baris tabel dengan kolom nomor, nama, usia, berat badan dan tanggal. Kolom nomor dan tanggal default, kolom nama, 
#usia dan berat badan diisi urut antara 20kg-60kg.
#Tipe data yang digunakan adalah int untuk nomor dan usia, string untuk nama, date untuk tanggal serta float untuk berat badan.  
#Lakukan seleksi column untuk menampilkan column dengan tipe data Float, lalu tampilkan pernyataan True untuk berat badan dibawah 50, 
#dan false untuk berat badan diatas 50kg.

#CLUE: Buat tabel terlebih dahulu, ubah tipe datanya, lalu lakukan seleksi column dengan memanfaatkan fungsi not dalam isin.

In [11]:
import numpy as np
import pandas as pd

In [65]:
data = {'Nama': ['Devi','Diana','Dina', 'Dinda', 'Difa'],
        'Usia': ['21','19','23', '16', '22'], 
        'Berat Badan': ['46','45','50', '48', '50'],}
        
df_sk = pd.DataFrame(data)

df_sk.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df_sk.reset_index ()
df.loc[:, ::-1]

  Berat Badan Usia   Nama               index
0          46   21   Devi 2000-01-01 00:00:00
1          45   19  Diana 2000-01-01 01:00:00
2          50   23   Dina 2000-01-01 02:00:00
3          48   16  Dinda 2000-01-01 03:00:00
4          50   22   Difa 2000-01-01 04:00:00

In [61]:
df_sk.dtypes

Nama           object
Usia           object
Berat Badan    object
dtype: object

In [70]:
df_sk = df_sk.astype({'Usia': 'int', 'Berat Badan': 'int'})
df.loc[:, ::-1]

  Berat Badan Usia   Nama               index
0          46   21   Devi 2000-01-01 00:00:00
1          45   19  Diana 2000-01-01 01:00:00
2          50   23   Dina 2000-01-01 02:00:00
3          48   16  Dinda 2000-01-01 03:00:00
4          50   22   Difa 2000-01-01 04:00:00

In [71]:
df_sk.dtypes

Nama           object
Usia            int32
Berat Badan     int32
dtype: object

In [79]:
df_sk[~df_sk['Berat Badan'].isin([50])]
df.loc[:, ::-1]

  Berat Badan Usia   Nama               index
0          46   21   Devi 2000-01-01 00:00:00
1          45   19  Diana 2000-01-01 01:00:00
2          50   23   Dina 2000-01-01 02:00:00
3          48   16  Dinda 2000-01-01 03:00:00
4          50   22   Difa 2000-01-01 04:00:00